const jdxc = [
  {
    id: 1,
    time: '2014-10-23', title: '《Hi歌》第二期 演唱《鱼》',
    describe: '2014年HI歌《鱼》，十大神级现场。这首原作很平淡的歌，硬是让姚贝娜演绎成了悲伤到尘埃里的悲情大歌，有层次，有跌宕，有起伏。一开口伤感就开始积郁，自怨自艾，当悲伤推到极致，高潮便一层一层的释放，接着浅吟低唱，仿若一段凝固的记忆，唱在我们的心中，只为了在想你时，拿出来，笑和哭泣！',
    img: 'http://www.yaobella.com/photo/live/live_1461483828567.jpg',
    url: 'http://www.yaobella.com/video/mp4/%E5%A7%9A%E8%B4%9D%E5%A8%9C%20-%20%E9%B1%BC%20%E7%8E%B0%E5%9C%BA%E7%89%88.mp4'
  },
  {
    id: 2,
    time: '2014-10-01', title: '2014年央视国庆晚会    演唱《一路有你》',
    describe: '2014年国庆，姚贝娜最后一次登上央视直播舞台，在央视举办的国庆晚会《我和我的祖国》上演唱了这首《一路有你》，这已是她十年歌手生涯的最后一个月，此时她病魔缠身已久，再过一月她就将因身体继续恶化无法登台。她在直播台上依然面带微笑，喜气洋洋，以饱满的热情和腔调表达了自己对祖国的祝福和炽热情感。',
    img: 'http://www.yaobella.com/photo/live/live_1462373428663.jpg',
    url: 'http://www.yaobella.com/video/mp4/%E5%9B%BD%E5%BA%86%E7%9B%B4%E6%92%AD%E8%8A%82%E7%9B%AE%E3%80%8A%E6%88%91%E5%92%8C%E6%88%91%E7%9A%84%E7%A5%96%E5%9B%BD%E3%80%8B%20%E5%A7%9A%E8%B4%9D%E5%A8%9C%E3%80%8A%E4%B8%80%E8%B7%AF%E6%9C%89%E4%BD%A0%E3%80%8B.mp4'
  }
]
export { jdxc }